src/InformationRegisters/Scan_ИсторияКомпаний/Scan_ИсторияКомпаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ИсторияКомпаний</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>EnumRef.Scan_ВидыДилеров</types>
      <types>CatalogRef.Scan_СтатусыКомпаний</types>
      <types>Boolean</types>
      <types>CatalogRef.Scan_Контрагенты</types>
      <types>CatalogRef.Scan_ГруппыКомпаний</types>
      <types>String</types>
      <types>CatalogRef.Scan_ФормыКомпаний</types>
      <types>CatalogRef.Scan_ТипыДилеров</types>
      <types>Date</types>
      <types>Number</types>
      <types>CatalogRef.Scan_МестаХранения</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Компания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗначения</name>
    <type>
      <types>EnumRef.Scan_ДополнительнаяИнформацияПоКомпаниям</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/Scan_ИсторияКомпаний/ManagerModule.bsl
//rarus vikhle 15.06.2020 mt 15888 +++
Функция ЗаписьЗначенияРегистраСведенийИсторияКомпаний(Компания,Значение,ВидЗначения,Дата = Неопределено) Экспорт
	Отказ = Ложь;
	Если Дата = Неопределено Тогда
		ДатаЗаписи = ТекущаяДата();
	Иначе
		ДатаЗаписи = Дата;
	КонецЕсли;
	
	СтруктураОтбора   = Новый Структура("Компания,ВидЗначения", Компания,ВидЗначения);
	СтруктураСведений = РегистрыСведений.Scan_ИсторияКомпаний.ПолучитьПоследнее(ДатаЗаписи, СтруктураОтбора);
	ЗначениеСтарое    = СтруктураСведений.Значение;
	Записывать        = Ложь;
	
	//Введено значение, а старое отсутствует
	Если ЗначениеЗаполнено(Значение) И ЗначениеСтарое = Неопределено Тогда 
		Записывать = Истина; 
	КонецЕсли; 
	//Значение стерто, а старое значение было введено
	Если НЕ ЗначениеЗаполнено(Значение) И ЗначениеСтарое <> Неопределено Тогда 
		Записывать = Истина; 
	КонецЕсли; 
	//Введено значение и было введено старое
	Если ЗначениеЗаполнено(Значение) И ЗначениеСтарое <> Неопределено Тогда
		//Значение изменилось
		Если Значение <> ЗначениеСтарое Тогда 
			Записывать = Истина; 
		КонецЕсли; 
	КонецЕсли; 
	Если Записывать Тогда
		//Значение параметра изменилось
		НоваяЗапись = РегистрыСведений.Scan_ИсторияКомпаний.СоздатьМенеджерЗаписи();
		НоваяЗапись.Компания	  	= Компания;
		НоваяЗапись.ВидЗначения     = ВидЗначения;
		НоваяЗапись.Значение        = Значение;
		НоваяЗапись.Период          = ДатаЗаписи;
		НоваяЗапись.Пользователь    = Пользователи.ТекущийПользователь();
		
		Попытка
			НоваяЗапись.Записать();
		Исключение
			Сообщить(НСтр("ru = 'Ошибка записи реквизита компании в регистр сведений'; en = 'Error writing company details to the information register'"));
			Отказ = Истина;
		КонецПопытки; 
	КонецЕсли;
	Возврат Отказ;
КонецФункции
//rarus vikhle 15.06.2020 mt 15888 ---
